#include <stdio.h>

int main(void) {
  long target = 1234567890; // наше число
  long i; // переменная для итерации + переменная для квадрата числа
  long num1 = 0, num2 = 0; // переменные для хранения делителей

  for (i = 1; i * i <= target; i++) { // перебираем все возможные делители
    if (target % i == 0) {            // если делитель найден
      num1 = i;                       // сохраняем делитель
      num2 = target / i;              // сохраняем соответствующий множитель
    }
  }
  long min_raz = num2 - num1; // вычисляем минимальную разность

  printf("1 %ld\n", num1); // выводим делитель
  printf("2 %ld\n", num2); // выводим соответствующий множитель
  printf("Мин разность: %ld\n", min_raz);

  return 0;
}
