#include <stdio.h>

int main(void) {
  long i;   // переменная для итерации (проверяемое число)
  long n;   // копия проверяемого числа
  long rev; // перевернутое числа
  long rem; // переменная для очередной цифры
  
  // Перебираем числа (в диапазоне до 100 000)
  for (i = 1; i <= 100000; i++) {
    n = i;      
    rev = 0;    
    
    // Поразрядно переворачиваем число
    while (n != 0) {
      rem = n % 10;         // берем младшую цифру
      rev = rev * 10 + rem; // сдвигаем rev и добавляем цифру
      n = n / 10;           // отбрасываем младшую цифру от n
    }
    
    // Если число, умноженное на 4, равно своему отражению
    if (i * 4 == rev) {
      printf("Found: %ld\n",i);
      printf("Reverse: %ld\n",rev);
    }
  }
  
  return 0;
}
